#include "SCI.h"

/*************************************************************/
/*                        初始化SCI                          */
/*************************************************************/
void SCI_Init(void) 
{
  SCI0BD = BUS_CLOCK/16/BAUD;          //设置SCI0波特率为9600
  SCI0CR1 = 0x00;                      //设置SCI0为正常模式，八位数据位，无奇偶校验
  SCI0CR2 = 0x0C;                      //允许发送、接收数据，禁止中断功能 
 // SCI0CR2 = 0x2C;                      //允许发送、接收数据使能接收中断功能 
}

/*************************************************************/
/*                       串口发送函数                        */
/*************************************************************/
void SCI_Send(unsigned char data) 
{
  while(!SCI0SR1_TDRE);                //等待发送数据寄存器（缓冲器）为空
  SCI0DRL = data;
}

/*************************************************************/
/*                  串口发送字符串函数                       */
/*************************************************************/
void SCI_PutStr(char *putchar) 
{
  while(*putchar!=0x00)                //判断字符串是否发送完毕
  {
    SCI_Send(*putchar++);  
  }
}

/*************************************************************/
/*                       串口接收函数                        */
/*************************************************************/
unsigned char SCI_Rev(void) 
{
  while(!SCI0SR1_RDRF);               //等待发送数据寄存器满
  return(SCI0DRL);
} 

